const 装备清单 = [
  {
    名称: '月海冲击枪',
    分类: '武器系统',
    描述: '以适应多种作战环境为目的而制造的冲击枪，易携带易获取，只是金属外壳容易留下指纹，每天保养起来很麻烦。',
    套装: '状态抵抗',
  },
  {
    名称: '星环充能枪',
    分类: '武器系统',
    描述: '',
    套装: '免疫',
  },
  {
    名称: '月海光伏推进器',
    分类: '推进系统',
    描述: '',
    套装: '状态抵抗',
  },
  {
    名称: '星环推进器',
    分类: '推进系统',
    描述: '',
    套装: '免疫',
  },
  {
    名称: '月海能源舱',
    分类: '能源系统',
    描述: '',
    套装: '状态抵抗',
  },
  {
    名称: '星环能源舱',
    分类: '能源系统',
    描述: '',
    套装: '免疫',
  },
  {
    名称: '月海金属盾',
    分类: '防护系统',
    描述: '',
    套装: '状态抵抗',
  },
  {
    名称: '星环能量盾',
    分类: '防护系统',
    描述: '',
    套装: '免疫',
  },
  {
    名称: '月海电子瞄具',
    分类: '瞄准元件',
    描述: '',
    套装: '状态抵抗',
  },
  {
    名称: '星环光学瞄具',
    分类: '瞄准元件',
    描述: '',
    套装: '免疫',
  },
  {
    名称: '月海抗体芯片',
    分类: '增幅元件',
    描述: '',
    套装: '状态抵抗',
  },
  {
    名称: '星环电子芯片',
    分类: '增幅元件',
    描述: '',
    套装: '免疫',
  },
];

export default 装备清单;
