const 装备清单 = [
  {
    名称: '烈锋冲击枪',
    分类: '武器系统',
    描述: '以极快激发速度著称的冲击能量枪，她的造型取自旧时代的某款枪械，或许是因为制造者希望它能见证历史......',
    套装: '速度',
  },
  {
    名称: '烈锋注能推进器',
    分类: '推进系统',
    描述: '采用红外线认证的能源推进器，请在装载推进器前，为 AG 设定身份标识......请不要使用袜子手套这类过于常见的标识。',
    套装: '速度',
  },
  {
    名称: '烈锋能源舱',
    分类: '能源系统',
    描述: '具有高转化率的核心舱，能加强 AG 的反应能力，象征炙热的红色射线布满舱体。',
    套装: '速度',
  },
  {
    名称: '烈锋钢制护盾',
    分类: '防护系统',
    描述: '钢制护盾，重量却比其他种类护盾轻了许多，所以除了战斗之外，应该还能成为 COS 用具。',
    套装: '速度',
  },
  {
    名称: '烈锋电子瞄具',
    分类: '瞄准元件',
    描述: '以“方方正正”为主要风格设计的电子瞄具，有 AG 反应它的显示玻璃过红，影响视力。',
    套装: '速度',
  },
  {
    名称: '烈锋追影芯片',
    分类: '增幅元件',
    描述: '虽然是常见的纳米制芯片，但额外提升了芯片的运算能力，能提升 AG 分析能力，但并不能解决中午去哪吃饭这个难题。',
    套装: '速度',
  }
];

export default 装备清单;
