const 装备清单 = [
  {
    名称: '烈锋冲击枪',
    分类: '武器系统',
    描述: '以极快激发速度著称的冲击能量枪，她的造型取自旧时代的某款枪械，或许是因为制造者希望它能见证历史......',
    套装: '速度',
  },
  {
    名称: '烈锋注能推进器',
    分类: '推进系统',
    描述: '',
    套装: '速度',
  },
  {
    名称: '烈锋能源舱',
    分类: '能源系统',
    描述: '',
    套装: '速度',
  },
  {
    名称: '烈锋钢制护盾',
    分类: '防护系统',
    描述: '',
    套装: '速度',
  },
  {
    名称: '烈锋电子瞄具',
    分类: '瞄准元件',
    描述: '',
    套装: '速度',
  },
  {
    名称: '烈锋追影芯片',
    分类: '增幅元件',
    描述: '',
    套装: '速度',
  }
];

export default 装备清单;
