const 装备清单 = [
  {
    名称: '暗夜复合枪剑',
    分类: '武器系统',
    描述: '以反击概念制造的复合武器，能够提升 AG 的反击能力。因为制造商只生产成年人用的型号，遭到了年纪小的 AG 投诉。',
    套装: '反击',
  },
  {
    名称: '暗夜能源舱',
    分类: '能源系统',
    描述: '能极大提高 AG 分析能力，敌人从哪来，使用什么招数，只要装配该核心舱体就能完全掌握......也能当演讲中的提词器。',
    套装: '反击',
  },
  {
    名称: '赛博射流枪',
    分类: '武器系统',
    描述: '以高精度为卖点的射流枪，如果能承受住那极高的后坐力，你可以用它来打穿每个企图伤害你的傀儡。',
    套装: '暴击',
  },
  {
    名称: '赛博能源舱',
    分类: '能源系统',
    描述: '与传统的核心舱不同，制造者强调此款核心舱注重攻击破坏力，但真正原因其实是他们制造的零件不够用了......',
    套装: '暴击',
  },
  {
    名称: '暗夜高能推进器',
    分类: '推进系统',
    描述: '可以记录战况并增加反击可能性。只是 AG 做什么都会记录，无论她们是否愿意，看来大数据都是以牺牲隐私为代价的。',
    套装: '反击',
  },
  {
    名称: '暗夜电能护盾',
    分类: '防护系统',
    描述: '除了能提供防护能力外，还能工具 AG 的习惯自动格挡敌人的攻击，只是整个护盾都利用电能驱动，需要随时充电。',
    套装: '反击',
  },
  {
    名称: '赛博热流推进器',
    分类: '推进系统',
    描述: '这时生成热流来强化 AG 输出功率的特制推进器，但就如同它的名字一样......在整修时难以从 AG 身上拆下来。',
    套装: '暴击',
  },
  {
    名称: '赛博铸铁盾',
    分类: '防护系统',
    描述: '制造者在盾牌上额外添加了小孔，以此使 AG 能够在举盾牌时观察战场。有时，通过这个小孔来看世界或许有另一种风味。',
    套装: '暴击',
  },
  {
    名称: '暗夜成像瞄具',
    分类: '瞄准元件',
    描述: '具备多功能的成像瞄具，不过它在市场上畅销是因为其小巧的造型被许多 AG 喜爱，据说制造者正在开发玩具模式。',
    套装: '反击',
  },
  {
    名称: '赛博成像仪',
    分类: '瞄准元件',
    描述: '通过光谱来探测敌人的新型成像仪，敌人躲在哪里都能找到，AG 间捉迷藏时会禁用此装备。',
    套装: '暴击',
  },
  {
    名称: '暗夜电子芯片',
    分类: '增幅元件',
    描述: '虽然是常见的纳米制芯片，但芯片内装载了分析程序，可以协助 AG 对敌人反击，在战斗外会作为闹钟使用。',
    套装: '反击',
  },
  {
    名称: '赛博超频芯片',
    分类: '增幅元件',
    描述: '虽然是常见的纳米制芯片，但突破了许多制造条约的限制，变得更容易让 AG 瞄准敌人的要害。',
    套装: '暴击',
  },
];

export default 装备清单;
