const 装备清单 = [
  {
    名称: '暗夜复合枪剑',
    分类: '武器系统',
    描述: '',
    套装: '反击',
  },
  {
    名称: '暗夜能源舱',
    分类: '能源系统',
    描述: '',
    套装: '反击',
  },
  {
    名称: '赛博射流枪',
    分类: '武器系统',
    描述: '',
    套装: '暴击',
  },
  {
    名称: '赛博能源舱',
    分类: '能源系统',
    描述: '',
    套装: '暴击',
  },
  {
    名称: '暗夜高能推进器',
    分类: '推进系统',
    描述: '',
    套装: '反击',
  },
  {
    名称: '暗夜电能护盾',
    分类: '防护系统',
    描述: '',
    套装: '反击',
  },
  {
    名称: '赛博热流推进器',
    分类: '推进系统',
    描述: '',
    套装: '暴击',
  },
  {
    名称: '赛博铸铁盾',
    分类: '防护系统',
    描述: '',
    套装: '暴击',
  },
  {
    名称: '暗夜成像瞄具',
    分类: '瞄准元件',
    描述: '',
    套装: '反击',
  },
  {
    名称: '赛博成像仪',
    分类: '瞄准元件',
    描述: '',
    套装: '暴击',
  },
  {
    名称: '暗夜电子芯片',
    分类: '增幅元件',
    描述: '',
    套装: '反击',
  },
  {
    名称: '赛博超频芯片',
    分类: '增幅元件',
    描述: '',
    套装: '暴击',
  },
];

export default 装备清单;
