const 装备清单 = [
  {
    名称: '诺亚射流枪',
    分类: '武器系统',
    描述: '能让 AG 更容易打击敌方的特制射流枪，无需再和世界玩概率游戏，主动权将在你的手中。当然对掷硬币是无效的。',
    套装: '状态命中',
  },
  {
    名称: '诺亚推进器',
    分类: '推进系统',
    描述: '',
    套装: '状态命中',
  },
  {
    名称: '诺亚能源舱',
    分类: '能源系统',
    描述: '',
    套装: '状态命中',
  },
  {
    名称: '诺亚合金盾',
    分类: '防护系统',
    描述: '',
    套装: '状态命中',
  },
  {
    名称: '诺亚电子瞄具',
    分类: '瞄准元件',
    描述: '',
    套装: '状态命中',
  },
  {
    名称: '诺亚特制芯片',
    分类: '增幅元件',
    描述: '',
    套装: '状态命中',
  },
];

export default 装备清单;
