const 装备清单 = [
  {
    名称: '诺亚射流枪',
    分类: '武器系统',
    描述: '能让 AG 更容易打击敌方的特制射流枪，无需再和世界玩概率游戏，主动权将在你的手中。当然对掷硬币是无效的。',
    套装: '状态命中',
  },
  {
    名称: '诺亚推进器',
    分类: '推进系统',
    描述: '制造商在推进器内安装了处理器，能够增幅 AG 的特殊武装。发动时声音也比其他型号轻得许多，适合隐秘行动的 AG。',
    套装: '状态命中',
  },
  {
    名称: '诺亚能源舱',
    分类: '能源系统',
    描述: '特殊材料制成的核心舱，加强了 AG 核心功率，更容易使用特殊武装。也会增加 AG 的卡路里消耗，广受 AG 们欢迎。',
    套装: '状态命中',
  },
  {
    名称: '诺亚合金盾',
    分类: '防护系统',
    描述: '比起普通制式盾牌，此款合金盾的大量研发预算被用于盾牌上的附着染料，据说可以提升 AG 的能力。',
    套装: '状态命中',
  },
  {
    名称: '诺亚电子瞄具',
    分类: '瞄准元件',
    描述: '构造与传统瞄具相同，内部追加了自主录像功能，能够迅速查明是 AG 还是指挥官偷吃的补丁。',
    套装: '状态命中',
  },
  {
    名称: '诺亚特制芯片',
    分类: '增幅元件',
    描述: '虽然是昌吉的纳米制芯片，但是外壳上追加了特殊模组，能够提升 AG 的特殊武装效能。',
    套装: '状态命中',
  },
];

export default 装备清单;
