const 装备清单 = [
  {
    名称: '古铁冲击枪',
    分类: '武器系统',
     描述: '旧武器改装而来，以破坏力著称的射流枪。人类战争从来没有停止过，而这把射流枪似乎永远会进化下去......',
    套装: '攻击',
  },
  {
    名称: '古铁推进器',
    分类: '推进系统',
     描述: '制造者在推进器内部导入了火控模组，战斗是它存在的唯一意义，但它却希望 AG 和指挥官有一天能够停止使用它。',
    套装: '攻击',
  },
  {
    名称: '古铁能源舱',
    分类: '能源系统',
     描述: '能够提高核心输出功率的特质核心舱，可以增强 AG 的攻击能力......以及酒量。',
    套装: '攻击',
  },
  {
    名称: '古铁复合盾',
    分类: '防护系统',
    描述: '在复合盾上加入了热能放大器，能够配合 AG 的武装提高杀伤力，盾面被制作的很大，有 AG 尝试用它来烤肉，效果很好。',
    套装: '攻击',
  },
  {
    名称: '古铁反应瞄具',
    分类: '瞄准元件',
    描述: '使用了能够融合各类武器的特质材料，可以提升 AG 的武装能力，但装载起来极为困难。',
    套装: '攻击',
  },
  {
    名称: '古铁芯片',
    分类: '增幅元件',
    描述: '虽然是常见的纳米制芯片，但额外提升的 AG 攻击能力，装载此芯片的 AG 能对敌人造成更多伤害，以及更容易赢得扳手腕。',
    套装: '攻击',
  },
];

export default 装备清单;
