const 装备清单 = [
  {
    名称: '制式射流枪',
    分类: '武器系统',
    描述: '各方面指标均是标准水平，虽然看起来普普通通，但往往普普通通的东西，才更容易长期存在下去。',
    套装: '生命',
  },
  {
    名称: '制式能源推进器',
    分类: '推进系统',
    描述: '没有特意功能，也没有奇奇怪怪的改造，它也只提供 AG 最需要的东西。在外壳部分设有急救盒，能为 AG 的生存提供保障。',
    套装: '生命',
  },
  {
    名称: '制式能源舱',
    分类: '能源系统',
      描述: '通过加速血液循环来增强 AG 意志的核心舱，比书和诗歌更有效得温暖你的内心，普通人无法安装。',
    套装: '生命',
  },
  {
    名称: '制式复合盾',
    分类: '防护系统',
    描述: '基础版本的复合盾牌，虽然是基础，但防御力却丝毫不输其他厂商的改造型号，可靠的性能深得 AG 们的信赖。',
    套装: '生命',
  },
  {
    名称: '制式瞄准镜',
    分类: '瞄准元件',
    描述: '兼容性最好的瞄具，无论什么武器都可以配置。为了方便 AG 保养还能够拆分为各个模块。',
    套装: '生命',
  },
  {
    名称: '制式电子芯片',
    分类: '增幅元件',
    描述: '常见的纳米制芯片，能够提升 AG 的作战效能，也能作为小型 U 盘拷贝数据。',
    套装: '生命',
  },
];

export default 装备清单;
