const 装备清单 = [
  {
    名称: '灵钢射流枪',
    分类: '武器系统',
    描述: '比起攻击力，更加注重防护的射流枪，特质枪壳在关键时刻能作为盾牌使用......但是请不要用来复现旧时代的枪斗术。',
    套装: '防御',
  },
  {
    名称: '灵钢增压推进器',
    分类: '推进系统',
    描述: '与传统天推进器不同，该推进器在外侧追加了大量装甲片，并完全不影响 AG 的行动速度，受到许多指挥官和 AG 的好评。',
    套装: '防御',
  },
  {
    名称: '灵钢能源舱',
    分类: '能源系统',
    描述: '强化了对 AG 的防护，质量优秀，制造商称即使战车碾过都不会有损伤......目前并没有 AG 和指挥官愿意验证此说法。',
    套装: '防御',
  },
  {
    名称: '灵钢防护盾',
    分类: '防护系统',
    描述: '在外侧加入了多种防弹插板，对任何攻击都有显著的减伤效果。当然也具有优秀的隔音功能，可以阻挡噪音和起床闹铃。',
    套装: '防御',
  },
  {
    名称: '灵钢成像镜',
    分类: '瞄准元件',
    描述: '在传统成像镜上追加了灵钢防护板，能够提升 AG 的防护能力，并据制造者称绿色显示屏将有助于改善视力。',
    套装: '防御',
  },
  {
    名称: '灵钢特制芯片',
    分类: '增幅元件',
    描述: '高硬度材料制成的电子芯片。搭配其他产品，将产生联动效应。“届时就只有垃圾食品能摧毁你的身体了！”', 
    套装: '防御',
  },
];

export default 装备清单;
